---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.MoreThanOneLoop
source: html/c0f972f3-26db-e989-a03d-475ed445f74a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.MoreThanOneLoop Property

GridChain sketch contains more than one loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId MoreThanOneLoop { get; }
```